УТ/src/Catalogs/CRM_УсловияСрабатыванияТриггеров/CRM_УсловияСрабатыванияТриггеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УсловияСрабатыванияТриггеров</name>
  <predefined>
    <items>
      <name>ПриПроведенииКоммерческогоПредложенияПоИнтересу</name>
      <description>Обработка проведения: Коммерческое предложение клиенту (по Интересу)</description>
    </items>
    <items>
      <name>ПоРасписанию</name>
      <description>По расписанию</description>
    </items>
    <items>
      <name>ПисьмоОтНовогоКлиента</name>
      <description>Получено письмо от нового клиента</description>
    </items>
    <items>
      <name>ВходящийТелефонныйЗвонокПоИнтересуКлиента</name>
      <description>При входящем звонке (по интересу)</description>
    </items>
    <items>
      <name>ВходящееЭлектронноеПисьмоПоИнтересуКлиента</name>
      <description>При входящем письме (по интересу)</description>
    </items>
    <items>
      <name>ВходящееСообщениеЧатаПоИнтересуКлиента</name>
      <description>При входящем сообщение чата (по интересу)</description>
    </items>
    <items>
      <name>ПриВыполненииЗадачи</name>
      <description>При выполнении задачи</description>
    </items>
    <items>
      <name>ПриВыполненииЗадачиПоИнтересу</name>
      <description>При выполнении задачи (по интересу)</description>
    </items>
    <items>
      <name>ПриВыполненииЗадачиПоОбъектуИнтереса</name>
      <description>При выполнении задачи по объекту интереса</description>
    </items>
    <items>
      <name>ПриДоставкеПоИнтересу</name>
      <description>При доставке (по интересу)</description>
    </items>
    <items>
      <name>ПриЗавершенииВзаимодействияПоИнтересу</name>
      <description>При завершении взаимодействия (по интересу)</description>
    </items>
    <items>
      <name>CRM_Модуль_ПриЗаписиЗаказаКлиента</name>
      <description>При записи заказа клиента</description>
    </items>
    <items>
      <name>ПриЗаполненииКлиентаВИнтересе</name>
      <description>При заполнении клиента в интересе</description>
    </items>
    <items>
      <name>ПриОплатеПоИнтересу</name>
      <description>При оплате (по интересу)</description>
    </items>
    <items>
      <name>ПриОтгрузкеПоИнтересу</name>
      <description>При отгрузке (по интересу)</description>
    </items>
    <items>
      <name>ПриВыбореНовогоСостоянияИнтереса</name>
      <description>При переходе в состояние интереса</description>
    </items>
    <items>
      <name>ПриПереходеНаЭтапБизнесПроцесса</name>
      <description>При переходе на этап бизнес процесса</description>
    </items>
    <items>
      <name>ПриПолученииОбратнойСвязи</name>
      <description>При получении обратной связи</description>
    </items>
    <items>
      <name>ПриПринятииКИсполнениюЗадачи</name>
      <description>При принятии к исполнению задачи</description>
    </items>
    <items>
      <name>ПриИзмененииТекущегоСостоянияИнтереса</name>
      <description>При смене текущего состояния интереса</description>
    </items>
  </predefined>
  <attributes>
    <name>ИспользоватьСКД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСтандартнаяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаПроверки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектДействия</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКОбработке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимОтладки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>EnumRef.CRM_СобытияТриггеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыОбработкиПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СервисныйВызов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВызова</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыОбработки</name>
    <attributes>
      <name>ОбъектОбработки</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_УсловияСрабатыванияТриггеров/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Свойство("ОбъектДействия") Тогда
		ОбъектДействия = Параметры.Отбор.ОбъектДействия;
		ОбновитьОтборПоОбъектуДействия();
			
		СтандартнаяОбработка = Ложь;
	Иначе
		МассивИсключаемых = Справочники.CRM_УсловияСрабатыванияТриггеров.МассивИсключаемыхПоФОПредопределенных();
		Если МассивИсключаемых.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка",
				 МассивИсключаемых, ВидСравненияКомпоновкиДанных.НеВСписке, ,
				 Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ОбъектДействия) Тогда
		ОбновитьОтборПоОбъектуДействия();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьОтборПоОбъектуДействия()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	УсловияСрабатывания.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CRM_УсловияСрабатыванияТриггеров КАК УсловияСрабатывания
	|ГДЕ
	|	УсловияСрабатывания.ОбъектДействия = &ОбъектОбработки
	|	И НЕ УсловияСрабатывания.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УсловияСрабатыванияОбъектыОбработки.Ссылка
	|ИЗ
	|	Справочник.CRM_УсловияСрабатыванияТриггеров.ОбъектыОбработки КАК УсловияСрабатыванияОбъектыОбработки
	|ГДЕ
	|	УсловияСрабатыванияОбъектыОбработки.ОбъектОбработки = &ОбъектОбработки
	|	И НЕ УсловияСрабатыванияОбъектыОбработки.Ссылка.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("ОбъектОбработки", ОбъектДействия);
	ДанныеДляОтбора = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка",
		ДанныеДляОтбора, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
	
КонецПроцедуры

#КонецОбласти
